src/Documents/фуВводНачальныхОстатков/фуВводНачальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>фуВводНачальныхОстатков</name>
  <registerRecords>AccumulationRegister.фуОстаткиНаРасчетныхСчетах</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>РасчетныйСчет</name>
      <type>
        <types>CatalogRef.фуРасчетныеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/фуОстаткиНаРасчетныхСчетах/фуОстаткиНаРасчетныхСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>фуОстаткиНаРасчетныхСчетах</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.фуРасчетныеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/фуВводНачальныхОстатков/ObjectModule.bsl
#Область о // Служебные процедуры и функции:

&НаСервере
Процедура ЗаписьДвижений_фуОстаткиНаРасчетныхСчетах(Отказ,Режим)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	//
	сОсновныеВалюты = фуОперацииСВалютамиКлиентСервер.ПолучитьОсновныеВалютыСервер();
	//
	
	// регистр фмОстаткиНаРасчетныхСчетах:
	Движения.фуОстаткиНаРасчетныхСчетах.Записывать = Истина;
	Для Каждого ТекСтрокаОплата Из Оплата Цикл
		
		ВалютаСчета = ТекСтрокаОплата.РасчетныйСчет.ВалютаСчета; 
		Если Не фуОбщийКлиентСервер.ПроверкаЗаполненияВалютыСчета(ВалютаСчета) Тогда
			
			фуОбщийКлиентСервер.ВывестиСообщениеОНеЗаполненнойВалютеСчета(ВалютаСчета,ТекСтрокаОплата,ЭтотОбъект,"Оплата");
			Отказ = Истина;
			
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			Если ТекСтрокаОплата.Сумма <> 0 Тогда 
				Движение = Движения.фуОстаткиНаРасчетныхСчетах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ЭтотОбъект.Дата;
				Движение.РасчетныйСчет = ТекСтрокаОплата.РасчетныйСчет;
				Движение.Сумма = ТекСтрокаОплата.Сумма;
				Движение.Основание = ЭтотОбъект.Комментарий;
			КонецЕсли;	
				
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область о // Стандартные процедуры и функции:

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписьДвижений_фуОстаткиНаРасчетныхСчетах(Отказ,Режим);
	
КонецПроцедуры

#КонецОбласти
